[
  {
    "id": "SCH0001",
    "title": "MPOWER Monthly Scholarship - June 2025: Pride Month",
    "amount": "$1,000",
    "awards": "3",
    "deadline": "2025/06/30",
    "sponsors": "MPOWER Financing",
    "description": "Our June scholarship celebrates the accomplishments of the LGBTQ+ community.\r\nMonthly Scholarships for International Students\r\n\r\nWe're thrilled to announce our Monthly Scholarship Series! MPOWER is awarding US$48,000 this year to help 36 international students fund their education dreams.\r\n\r\nHow this works:\r\n- On the first day of each month, check out this page to find out the scholarship theme for the month. \r\n- You can subscribe to our student newsletter to be alerted when the new scholarship is announced.\r\n- Be sure to apply quickly! Applications will be open until the last Friday of the month.\r\nRead below to find out more about this month's scholarship!",
    "eligibilityRequirements": "- Be admitted to, or enrolled in, a full-time degree program at a U.S. or Canadian school that MPOWER supports, and\r\n- Be an international student permitted to legally study in the U.S. or Canada, as applicable:\r\n  + For study in the U.S., this means that the applicant meets one of these criteria:\r\n    - Has a valid visa that permits study in the U.S., or\r\n    - Is protected under the Deferred Action for Childhood Arrivals (DACA)\r\n  + For study in Canada, this means the applicant must meet the following criteria:\r\n    - Has a valid Canadian study permit\r\n\r\nU.S. citizens who wish to study in the U.S. and Canadian citizens who wish to study in Canada are not eligible for this scholarship.",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA & Canada",
    "officialLink": "https://www.mpowerfinancing.com/scholarships/monthly-scholarships",
    "additionalNotes": ""
  },
  {
    "id": "SCH0002",
    "title": "MPOWER Global Citizen Scholarship",
    "amount": "$8,000 - $2,000 - $1,000",
    "awards": "Not Specified",
    "deadline": "2025/07/31",
    "sponsors": "MPOWER Financing",
    "description": "We've intentionally designed the Global Citizen Scholarship to be as broad as possible to match the broad, diverse experiences of international and DACA students. There's no requirement to be an MPOWER borrower to apply!\r\n\r\nAt MPOWER, we believe that we're not just expanding access to higher education. We're also creating globally-minded, multi-lingual, culturally-competent graduates poised to take on the world's most pressing problems in science, technology, business, and public policy!\r\n\r\nIn recognition of the extraordinary potential of these students, we've created the MPOWER Global Citizen Scholarship. We've intentionally designed this scholarship program to be as broad as possible to match the broad, diverse experiences of international students. There's no requirement to be an MPOWER borrower to apply!\r\n\r\nScholarships awarded annually to international and DACA students enrolled at schools MPOWER supports. \r\n\r\nAwards:\r\n\r\nGrand Prize: $8,000\r\nFirst Runner-Up: $2,000\r\nSecond Runner-Up: $1,000",
    "eligibilityRequirements": "- Be accepted at, or enrolled in, a full-time degree program at a U.S. or Canadian school that MPOWER supports, and\r\n- Be an international student allowed to legally study in the U.S. or Canada, as applicable:\r\n   + For study in the U.S., this means that the applicant meets one of these criteria:\r\n       - Has a valid visa that permits study in the U.S.\r\n       - Is protected under the Deferred Action for Childhood Arrivals (DACA)\r\n       - Is a U.S. permanent resident (Green Card holder)\r\n   + For study in Canada, this means the applicant meets one of these criteria:\r\n       - Is a Canadian permanent resident\r\n       - Has a valid Canadian study permit\r\n\r\nWe have created this scholarship specifically for international and DACA students. Therefore, U.S. citizens wishing to study in the U.S. and Canadian citizens wishing to study in Canada are not eligible for this scholarship.",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA & Canada",
    "officialLink": "https://www.mpowerfinancing.com/scholarships/global-citizen",
    "additionalNotes": ""
  },
  {
    "id": "SCH0003",
    "title": "MPOWER Women in STEM Scholarship",
    "amount": "$5,000 - $2,000 - $1,000",
    "awards": "Not Specified",
    "deadline": "2025/07/31",
    "sponsors": "MPOWER Financing",
    "description": "We believe in addressing inequality in education. In recognition of the extraordinary potential of women in the sciences, we created the MPOWER Women in STEM Scholarship. You don't need to be an MPOWER borrower to apply! What are you waiting for?\r\n\r\nEmpowering women in STEM\r\n\r\nIn keeping with MPOWER's commitment to empower high-potential global citizens to realize their educational aspirations – and become tomorrow's leading scientists and innovators – this international scholarship program focuses on women who will use their STEM degree to benefit society and the planet and who have the potential to serve as role models and advocates for women in STEM.\r\n\r\nThe National Center for Education Statistics reported that 32% of STEM degrees in the U.S. were awarded to women in one year. Women majoring in computer engineering, nuclear science and software development, amongst others, should not be challenged in funding their dream. In addition, the Society of Women Engineers found that gender inequities are especially pronounced in engineering and computer science, with just 20% of bachelor's degrees in engineering and computer science held by women.\r\n\r\nFor MPOWER CEO and Co-founder Manu Smadja, these statistics represent a social challenge to address. \r\n\r\n\"It's critical for us as a society to have a meaningful representation of women shaping the science and technology of tomorrow,\" Smadja says. \"The world may look a lot different if we do a better job at enabling female talent to shape the technologies transforming healthcare, education, transportation or cities for instance. \r\n\r\n\"By helping talented female students study and work in North America, we're helping close the gender gap in the STEM workforce. But we'd like to do much more, and starting this new scholarship program for women in STEM is yet another way to level the playing field.\"\r\n\r\nScholarships awarded annually to international and DACA students enrolled at schools MPOWER supports. \r\n\r\nAwards:\r\n\r\nGrand Prize: $5,000\r\nFirst Runner-Up: $2,000\r\nSecond Runner-Up: $1,000",
    "eligibilityRequirements": "- Be accepted at, or enrolled in, a full-time degree program at a U.S. or Canadian school that MPOWER supports, and\r\n- Be an international student allowed to legally study in the U.S. or Canada, as applicable:\r\n   + For study in the U.S., this means that the applicant meets one of these criteria:\r\n       - Has a valid visa that permits study in the U.S.\r\n       - Is protected under the Deferred Action for Childhood Arrivals (DACA)\r\n       - Is a U.S. permanent resident (Green Card holder)\r\n   + For study in Canada, this means the applicant meets one of these criteria:\r\n       - Is a Canadian permanent resident\r\n       - Has a valid Canadian study permit\r\n\r\nWe have created this scholarship specifically for international and DACA students. Therefore, U.S. citizens wishing to study in the U.S. and Canadian citizens wishing to study in Canada are not eligible for this scholarship.",
    "studyLevel": "All",
    "fieldOfStudy": "STEM",
    "country": "USA & Canada",
    "officialLink": "https://www.mpowerfinancing.com/scholarships/women-in-stem",
    "additionalNotes": ""
  },
  {
    "id": "SCH0004",
    "title": "MPOWER MBA Scholarship",
    "amount": "$5,000 - $2,000 - $1,000",
    "awards": "Not Specified",
    "deadline": "2025/07/31",
    "sponsors": "MPOWER Financing",
    "description": "Our newest scholarship is designed specifically for MBA students in the US and Canada.\r\n\r\nWe're thrilled to announce our new MBA scholarship! MPOWER will be awarding up to US$10,000 to support international students. You must be pursuing an MBA at an MPOWER-eligible school to apply, but you don't need to be an MPOWER borrower.\r\n\r\nAwards:\r\n\r\nGrand Prize: US$5,000\r\nFirst Runner-Up: US$2,000\r\nSecond Runner-Up: US$1,000",
    "eligibilityRequirements": "- Be admitted to, or enrolled in, a full-time MBA degree program at a U.S. or Canadian school that MPOWER supports, and\r\n- Be an international student permitted to legally study in the U.S. or Canada, as applicable:\r\n  + For study in the U.S., this means that the applicant meets one of these criteria:\r\n    - Has a valid visa that permits study in the U.S., or\r\n    - Is protected under the Deferred Action for Childhood Arrivals (DACA)\r\n  + For study in Canada, this means the applicant must meet the following criteria:\r\n    - Has a valid Canadian study permit\r\n\r\nU.S. citizens wishing to study in the U.S. and Canadian citizens wishing to study in Canada are not eligible for this scholarship.",
    "studyLevel": "Master's",
    "fieldOfStudy": "Business",
    "country": "USA & Canada",
    "officialLink": "https://www.mpowerfinancing.com/scholarships/mba-scholarship",
    "additionalNotes": ""
  },
  {
    "id": "SCH0005",
    "title": "REVIEW IT Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/05/15",
    "sponsors": "Dr. Gabriel and Christine Chiu",
    "description": "Dr. Gabriel and Christine Chiu are active philanthropists who avidly support a variety of organizations such as: Children Mending Hearts, Cedars Sinai, the American Red Cross, St. Jude Children's Research Hospital, John Wayne Cancer Institute, Children's Action Network, GenArt, AVIVA, Project Angel Food, Center Dance Arts, Barbara Davis Center for Childhood Obesity, the Metropolitan Museum of Art, Help for Orphans, the American Red Cross, P.S. Arts, Los Angeles Philharmonic, Art of Elysium, Nancy Davis Foundation for Multiple Sclerosis, Children's Action Network and the Music Center.",
    "eligibilityRequirements": "To be considered eligible for the \"Review It\" Scholarship you must:\r\n\r\nA) Be attending college or university no later than September of 2025.\r\n\r\nB) Have achieved a GPA of 2.5 or greater during their last academic year.\r\n\r\nC) Be attending or planning to attend a school in the US.\r\n\r\nD) Submit your Movie Review no later than 11:59 PM EST on the day of the deadline.\r\n\r\n*Note that you can be enrolled in any field of study\r\n\r\nThe scholarship winner will be announced roughly six weeks after the deadline and will be posted on this website immediately after. All applications must be received by 11:59 PM EST on the day of the deadline. No late applications will be reviewed.",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://chiureviewsscholarship.com/reviews.php",
    "additionalNotes": ""
  },
  {
    "id": "SCH0006",
    "title": "Study a Bachelor's in the USA Scholarship 202",
    "amount": "$5,000",
    "awards": "Not Specified",
    "deadline": "2025/06/28",
    "sponsors": "educations.com",
    "description": "Are you looking for scholarships to study in the USA? We can help! At educations.com, we believe that students who study abroad become the next generation of globally-minded adventurers – so we want more of you to do it!\r\n\r\nWe know that when studying abroad in America, scholarships are crucial. That's why we're offering one Bachelor's degree scholarship of up to $5,000 to help cover your tuition fees and get you one step closer to your next great adventure.\r\n\r\nThis Bachelor's degree scholarship will be awarded for students beginning their studies in the Fall 2025 semester or after and is worth up to $5,000. It's open to students from any country who will be studying a Bachelor's degree abroad at a college or university in the USA.\r\n\r\nOur ideal candidate\r\nAre you the next globally-minded adventurer?\r\n\r\nIf you're planning on studying abroad in America, scholarships are only one part of your journey. We already know you have a courageous and adventurous spirit because of your decision to study abroad, but what else are we looking for in a candidate?\r\n\r\nYou are:\r\n\r\nGlobally-minded and interested in other cultures\r\nA high academic achiever with consistently outstanding grades\r\nInvolved in extracurricular groups and activities\r\nExcited to begin your adventure and share your story with the world!",
    "eligibilityRequirements": "To apply for our scholarship:\r\n\r\nYou must have applied (or will apply) to a college or university in the USA.\r\nYou must have applied (or will apply) for a Bachelor's level degree starting in Fall 2025.\r\nThe degree program must be studied either on campus or online via distance learning from an institute based in the USA.\r\nYou must meet the entry requirements for the college or university, including:\r\nHolding a valid transcript from your high school (or equivalent)\r\nMeeting any language requirements for the program\r\nYou must hold or be eligible to apply for a relevant study visa (if applicable).\r\nYou cannot hold US citizenship or currently reside in the USA unless you are currently studying abroad.",
    "studyLevel": "Bachelor's",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.educations.com/scholarships/study-a-bachelors-in-usa-19901",
    "additionalNotes": ""
  },
  {
    "id": "SCH0007",
    "title": "Study a Master's in Europe Scholarship 2026",
    "amount": "€5,000",
    "awards": "Not Specified",
    "deadline": "2025/05/15",
    "sponsors": "educations.com",
    "description": "Looking for a Master's degree scholarship in Europe? We can help. At educations.com, we believe that students who study abroad become the next generation of globally minded leaders—and we want more of you to do it!\r\n\r\nEurope is an incredible place to study abroad, but many of you need a scholarship for Master's degree studies to make your dreams come true. That's why we're offering one Master's degree scholarship of up to €5000 to help cover your tuition fees and get you one step closer to your next great adventure.\r\n\r\nThe scholarship will be awarded for the Fall 2026 semester onwards up to a value of €5000, and is open to students from any country who will be studying a Master's degree abroad at a European university or graduate school.\r\n\r\nThe application period ends on May 15, 2026 at 12:00 CEST.\r\n\r\nOur ideal candidate\r\nAre you the next globally-minded leader?\r\n\r\nIf you're looking for a scholarship in Europe, we know you're well on your path to studying abroad. Having taken this leap, it's clear that you have a courageous and adventurous spirit. What else are we looking for in a candidate?\r\n\r\nGlobally minded and interested in other cultures\r\nMotivated and inspired to positively change the world\r\nA high academic achiever with consistently outstanding grades\r\nInvolved in extra-curricular groups and activities\r\nExcited to begin your adventure and share your story with the world!",
    "eligibilityRequirements": "To apply for this scholarship:\r\n\r\nYou must have applied (or will apply) to a university or graduate school within Europe.\r\nYou must have applied (or will apply) for a Master's-level degree starting in the Fall of 2026.\r\nThe degree program must be studied in Europe or online via distance learning from a European institute.\r\nYou must meet the entry requirements for the university or graduate school, including:\r\nHolding a valid undergraduate (Bachelor's) degree\r\nMeeting language requirements for the program\r\nYou must hold or be eligible to apply for a relevant study visa (if applicable).\r\nYou must be studying abroad in a country:\r\nWhere you do NOT hold citizenship \r\nThat you do NOT currently reside in (unless currently studying abroad).",
    "studyLevel": "Master's",
    "fieldOfStudy": "All Fields",
    "country": "Europe",
    "officialLink": "https://www.educations.com/scholarships/study-a-masters-in-europe-15211",
    "additionalNotes": ""
  },
  {
    "id": "SCH0008",
    "title": "Go Global MBA Scholarship 2026",
    "amount": "$7,000",
    "awards": "Not Specified",
    "deadline": "2026/04/24",
    "sponsors": "educations.com",
    "description": "Looking for an MBA scholarship? You're in the right place!\r\n\r\nWe know that finding MBA scholarships isn't easy. At educations.com, we believe that studying abroad helps shape the next generation of globally-minded leaders in business – and we want more of you to have that opportunity.\r\n\r\nThe Go Global scholarship for MBA studies will be awarded from the Fall 2026 semester onwards up to a value of $7,000, and is open to students from any country who will be studying for an MBA degree abroad at a university or business school.\r\n\r\nThe application period ends on April 24, 2026 at 12:00 CEST\r\n\r\nOur ideal candidate\r\nAre you the next globally-minded leader in business?\r\n\r\nOur MBA scholarships aim to help students take the next step in their careers and study an MBA abroad. Your choice to study abroad already demonstrates your dream of working across borders and communities. Here's what else we're looking for in a candidate:\r\n\r\nGlobally-minded leader in business aiming for an international career\r\nAt the beginning of your career in business management\r\nSelf-starter with entrepreneurial spirit\r\nSelf-motivated and inspired to make your mark on industry\r\nA strong interest in making the world more sustainable",
    "eligibilityRequirements": "To apply for this scholarship for MBA studies:\r\n\r\nYou must have applied (or will apply) for an MBA program that begins in Fall 2026.\r\nYou should have no more than 5 years of relevant professional work experience.\r\nYou must meet the entry requirements of your chosen university or business school, including:\r\nHolding a valid undergraduate (Bachelor's) degree\r\nMeeting the language requirements for the program\r\nYou must hold or be eligible to apply for a relevant study visa (if applicable).\r\nYou must be studying abroad in a country:\r\nWhere you do not hold citizenship\r\nThat you do not currently reside in (unless currently studying abroad)",
    "studyLevel": "Master's",
    "fieldOfStudy": "Business",
    "country": "Global",
    "officialLink": "https://www.educations.com/scholarships/go-global-mba-scholarship-20629",
    "additionalNotes": ""
  },
  {
    "id": "SCH0009",
    "title": "Women's Scholarship for International Students 2025",
    "amount": "$5,000",
    "awards": "Not Specified",
    "deadline": "2025/08/25",
    "sponsors": "educations.com",
    "description": "Are you a woman looking for scholarships to study abroad? We can help! This scholarship will be awarded for female students on all higher study level and is worth up to $5,000.\r\n\r\nThis women scholarship for international students will be awarded for female students beginning their undergraduate, graduate, or post-graduate studies in the Spring or Fall 2026 semester or after and is worth up to $5,000.\r\n\r\nIt's open to women international students from any country who will be studying an undergraduate, graduate, or post-graduate degree abroad at a college or university. The awards can be used to help cover your tuition fees and get you one step closer to your next great adventure.\r\n\r\nOur ideal candidate\r\nAre you the next globally-minded adventurer?\r\n\r\nIf you're a woman planning on studying abroad as an undergraduate, graduate, or post-graduate student, scholarships are only one part of your journey. We already know you have a courageous and adventurous spirit because of your decision to study abroad, but what else are we looking for in a candidate?\r\n\r\nYou are:\r\nA globally-minded woman and interested in other cultures.\r\nPlanning to enroll or enrolled in an undergraduate, graduate, or post-graduate program.\r\nA high academic achiever with consistently outstanding grades and achievements in your proposed field of study.\r\nInvolved in extracurricular groups and activities.\r\nExcited to begin your adventure and share your unique story as a woman with the world!",
    "eligibilityRequirements": "To apply for our scholarship:\r\n\r\nYou must be a woman.\r\nYou must have a plan to enroll in any undergraduate, graduate, or post-graduate (doctoral-level) degree program at a college, university, or institute of higher education.\r\nYou must meet the entry requirements for the university or college of your choice.\r\nHold valid credentials required for enrollment.\r\nMeet language requirements for the program.\r\nYou must hold or be eligible to apply for a relevant study visa.\r\nYou must not be a citizen or permanent resident of the country to which you are applying.",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "Global",
    "officialLink": "https://www.educations.com/scholarships/women-scholarship-for-international-students",
    "additionalNotes": ""
  },
  {
    "id": "SCH0010",
    "title": "Graduate Study in the USA Scholarship 2025",
    "amount": "$5,000",
    "awards": "Not Specified",
    "deadline": "2025/09/28",
    "sponsors": "educations.com",
    "description": "We know that when studying abroad in America, scholarships are crucial. That is why we are offering our first ever Master's degree scholarship to study in the USA in 2025!\r\n\r\nAt educations.com, we believe that students who study abroad become the next generation of globally-minded adventurers – so we want more of you to do it.\r\n\r\nGraduate Study in the USA scholarship is our first ever Master's degree scholarship to help cover your tuition fees, and get you one step closer to your next great adventure, in the USA.\r\n\r\nThis Master's degree scholarship will be awarded for students beginning their studies in the Fall 2025or after and is worth up to $5,000. It's open to international students from any country outside the USA who will be studying a Master's degree abroad at a college or university in the USA.\r\n\r\nThe application period for this opportunity ends on 23 September 2025 at 12:00 CEST.\r\n\r\nOur ideal candidate\r\nAre you the next globally-minded adventurer?\r\n\r\nIf you're planning on studying abroad as a graduate student in America, scholarships are only one part of your journey. We already know you have a courageous and adventurous spirit because of your decision to study abroad, but what else are we looking for in a candidate?\r\n\r\nYou are:\r\n\r\nGlobally-minded and interested in other cultures\r\nA high academic achiever with consistently outstanding grades\r\nInvolved in extracurricular groups and activities that support and compliment your studies\r\nExcited to begin your adventure and share your story with the world!",
    "eligibilityRequirements": "To apply for our scholarship:\r\n\r\nYou must have a plan to enroll at any accredited graduate program in the USA\r\nYou must meet the entry requirements for the university or graduate school of your choice.\r\nHold valid credentials required for graduate enrollment\r\nMeet language requirements for the program\r\nYou must hold or be eligible to apply for a relevant study visa.\r\nYou must not be a citizen or permanent resident of the USA.",
    "studyLevel": "Master's",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.educations.com/scholarships/graduate-study-in-the-usa-scholarship-2024",
    "additionalNotes": ""
  },
  {
    "id": "SCH0011",
    "title": "Undergraduate in STEM Scholarship 2025",
    "amount": "$5,000",
    "awards": "Not Specified",
    "deadline": "2025/09/23",
    "sponsors": "educations.com",
    "description": "Are you looking for scholarships to study a STEM undergraduate degree program abroad? We can help! At educations.com, we believe that students who study abroad become the next generation of globally-minded adventurers – so we want more of you to do it.\r\n\r\nThis STEM degree scholarship will be awarded for students beginning their STEM studies in the Fall 2025 semester or after and is worth up to $5,000. It's open to international students from any country who will be studying an undergraduate STEM degree abroad at a college or university.\r\n\r\nOur ideal candidate\r\n \r\nAre you the next globally-minded adventurer?\r\n\r\nIf you're planning on studying abroad as an undergraduate STEM student, scholarships are only one part of your journey. We already know you have a courageous and adventurous spirit because of your decision to study abroad, but what else are we looking for in a candidate?\r\n\r\nYou are:\r\nGlobally-minded and interested in other cultures\r\nPlanning to enroll or enrolled in an undergraduate program within science, technology, engineering, or mathematics.\r\nA high academic achiever with consistently outstanding grades and achievements in fields relevant to your chosen STEM subject(s)\r\nInvolved in extracurricular groups and activities\r\nExcited to begin your adventure and share your story with the world!",
    "eligibilityRequirements": "To apply for our scholarship:\r\n\r\nYou must have a plan to enroll at any undergraduate STEM* degree program (e.g. Bachelor of Science, Bachelor of Engineering, etc.)\r\nYou must meet the entry requirements for the university or college of your choice.\r\nHold valid credentials required for undergraduate enrollment\r\nMeet language requirements for the program.\r\nYou must hold or be eligible to apply for a relevant study visa.\r\nYou must not be a citizen or permanent resident of the country to which you are applying.\r\n* Fields of Study that qualify for the STEM scholarship: for the purpose of this scholarship, STEM is defined as Science, Technology, Engineering, and Mathematics. Programs that fall into these disciplines will be considered for eligibility on an individual basis and we reserve the right to reject applicants if the specified program does not fit within the STEM fields.",
    "studyLevel": "Bachelor's",
    "fieldOfStudy": "STEM",
    "country": "USA",
    "officialLink": "https://www.educations.com/scholarships/undergraduate-in-stem-scholarship",
    "additionalNotes": ""
  },
  {
    "id": "SCH0012",
    "title": "Rotary Peace Fellowships",
    "amount": "Fully funded",
    "awards": "130",
    "deadline": "2025/05/15",
    "sponsors": "Rotary International",
    "description": "Each year, Rotary awards up to 130 fully funded fellowships for dedicated leaders from around the world to study at one of our peace centers. Through academic training, practice, and global networking opportunities, the Rotary Peace Centers program develops the capacity of peace and development professionals to become effective catalysts for peace. The fellowships cover tuition and fees, room and board, round-trip transportation, and internship and field-study expenses.\r\n\r\nThe Rotary Peace Fellowship is designed for leaders with work experience in peace and development. Our fellows are committed to community and international service and the pursuit of peace. Each year, The Rotary Foundation awards up to 50 fellowships for master's degrees and up to 80 for certificate studies at premier universities.\r\n\r\nMaster's degree programs: Accepted candidates study peace and development issues with research-informed teaching and a diverse student body. The programs last 15 to 24 months and include a two- to three-month field study, which participants design themselves.\r\n\r\nProfessional development certificate program: During the one-year blended learning program, experienced peace and development professionals with diverse backgrounds gain practical skills to promote peace within their communities and regions. Fellows complete field studies and design and carry out a social change initiative.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Have three years of related work experience for the master's program (five years for the Duke program)\r\n- Have five years of related work experience for the certificate program and be able to explain how their plan to promote peace aligns with Rotary's mission\r\n- For Makerere University: must either be from Africa, have worked in Africa, or work with African communities or initiatives outside the continent\r\n- Be proficient in English\r\n- Have a bachelor's degree\r\n- Demonstrate leadership skills\r\n- Have a strong commitment to cross-cultural understanding and peace\r\n- Have at least three years between the completion of their most recent academic degree program and their intended start date for the fellowship\r\n- Candidates currently enrolled in an undergraduate or graduate program are not eligible to apply",
    "studyLevel": "Master's & Certificate",
    "fieldOfStudy": "Peace and Development Studies",
    "country": "Australia, Japan, Sweden, Uganda, United Kingdom, United States",
    "officialLink": "https://www.rotary.org/en/our-programs/peace-fellowships",
    "additionalNotes": "Two program types: 1) Master's degree programs (15-24 months, up to 50 fellowships) at five Rotary Peace Centers, 2) Professional development certificate program (1 year blended learning, up to 80 fellowships) in Thailand or Uganda. Since 2002, over 1,800 fellows trained, now working in 140+ countries."
  },
  {
    "id": "SCH0013",
    "title": "Ultatel Scholarship Grant",
    "amount": "$2,500",
    "awards": "1",
    "deadline": "2025/06/01",
    "sponsors": "Ultatel",
    "description": "As a leading unified communications provider for businesses of any size, Ultatel is looking for fresh ideas on business and communications from forward-thinking individuals. The scholarship is designed to help further education or career aspirations for students with a passion for communication technologies.\r\n\r\nThe scholarship award is a one-time $2,500 grant to help cover undergraduate tuition and fees. Ultatel will mail a check directly to your college or university on your behalf.\r\n\r\nApplication Requirements:\r\n- Cover letter introducing yourself and stating your reason for applying and describing your goals\r\n- 500-word essay explaining how communication has changed over the years in response to advancements in technology, why good communication is essential in every business, and identifying at least 3 problems in communication that technology can solve",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be prospective students who qualify for admission to an institution in the years 2024 or 2025\r\n- Be pursuing a degree in one of the following fields: Mass Communications, Development Communications, Information Systems, Software Development, Web Development, Cyber Security, Computer Science, Management and Technology\r\n- Have an acceptance letter from the college or university\r\n- Submit a cover letter and 500-word essay as part of the application",
    "studyLevel": "Bachelor's",
    "fieldOfStudy": "Mass Communications, Information Systems, Software Development, Web Development, Cyber Security, Computer Science, Management and Technology",
    "country": "USA",
    "officialLink": "https://www.ultatel.com/ultatel-scholarship-grant/",
    "additionalNotes": "Winner announced August 1, 2025. Previous winner: Kristine Dziedziula from Our Lady of Mercy Academy in Syosset, NY (chosen from 200+ applicants). Applications currently open for 2025."
  },
  {
    "id": "SCH0014",
    "title": "Skoolville's Scholarship for Exemplary International Students",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/12/01",
    "sponsors": "Skoolville Inc",
    "description": "Skoolville is an online study abroad consultancy providing free counseling services to international students interested in applying to USA, Canada, and Australia universities. Skoolville.com provides full support and assistance to international students including profile evaluation, selecting universities, preparing SOP and LORs, submitting applications, visa preparation, and pre-departure formalities. All services offered by us are 100% free.\r\n\r\nSkoolville.com is directly partnered with several universities across USA, Canada, and Australia and is rated 5 stars in Google by our students. Due to our continuing commitment to assisting students, we are supplementing our efforts with a scholarship award for international undergraduate and graduate students that are studying at an accredited US college or university.\r\n\r\nEssay Requirement: Write an 800-1000 word essay on \"Trends in International student migration\" demonstrating research from the past 5 years, personal opinion, and a conclusion exploring the future.\r\n\r\nGrading Criteria: 60% comprehension of subject matter, 30% ability to balance ideas within word-limit, 10% spelling & grammar.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be enrolled, or due to be enrolled, as a full-time student at an accredited US college or university for the semester applying for\r\n- Be an international undergraduate or graduate student at a college or university in the US\r\n- Have a minimum 3.4 GPA\r\n- Students attending online universities are welcome to apply\r\n- Submit proof of enrollment (transcript, acceptance letter, or tuition bill)\r\n- Submit 800-1000 word essay on specified topic\r\n- Avoid overly political arguments and must cite references\r\n- Complete application form with: Full Name, Email, College Name & Address, Proof of Enrollment (.jpeg, .pdf, or .doc), Essay (.pdf or .doc), Terms & Conditions acceptance",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://skoolville.com/scholarship",
    "additionalNotes": "Non-renewable yearly scholarship. Funds sent via check to college/university for qualified expenses (tuition, fees, books, on-campus room & board). Winner selected by Skoolville panel and notified via email. Contact: skoolvillescholarship@gmail.com. Strong privacy protections - no marketing use of applicant data."
  },
  {
    "id": "SCH0015",
    "title": "RentHop's College and University Scholarship Program",
    "amount": "$1,000",
    "awards": "Not Specified",
    "deadline": "2025/04/30",
    "sponsors": "RentHop",
    "description": "The RentHop Apartment Scholarship awards up to $2,000 a year to eligible undergraduate students in bachelor's and associate's degree programs in the US who demonstrate the ambition, diligence, leadership, and entrepreneurial spirit that is central to our company culture.\r\n\r\nRentHop was founded in 2008 by two co-founders who experienced bad apartment search experiences in NYC after college. They wondered why technology had not yet solved the pain of finding a rental home. Using quantitative algorithms and technology, they created RentHop, a site that sorts listings by quality using their HopScore algorithm.\r\n\r\nEssay Requirement: Submit an essay under 500 words that answers: \"Imagine yourself 10 years in the future after having graduated college and living the life of your dreams: find a listing on RentHop you picture yourself living in and write how it contributes to your ideal day. Please provide a link to the listing.\"\r\n\r\nRentHop currently allows searching for apartments in NYC, Boston, Chicago, and most major U.S. cities.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be a current student in an eligible undergraduate program or a graduating high school senior\r\n- Be working towards a bachelor's degree or associate's degree\r\n- Submit essay under 500 words using their Scholarship Application Form\r\n- Apply using school email address (personal email accepted if school doesn't provide one)\r\n- Submit by midnight Eastern Time of application deadline\r\n- If selected, must provide PDF proof of acceptance letter or enrollment verification\r\n- Demonstrate ambition, diligence, leadership, and entrepreneurial spirit",
    "studyLevel": "Bachelor's",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.renthop.com/resources/college-scholarship",
    "additionalNotes": "Two application deadlines per year: April 30 at 11:59pm ET and August 31 at 11:50pm ET. Recipients notified within 30 days of each deadline. Scholarship checks may be sent directly to recipient's school depending on school policy. Finalists may be featured on RentHop blog. Contact: college-scholarship@renthop.com"
  },
  {
    "id": "SCH0016",
    "title": "Learning Goals Essay Scholarship",
    "amount": "$500",
    "awards": "1",
    "deadline": "2025/08/01",
    "sponsors": "NYCTutoringServices.com",
    "description": "The goal of the tutoring team at NYCTutoring.com is to help every learner reach his or her academic potential. For their $500 annual scholarship, they invite participants to submit an essay of 500–750 words discussing their learning goals and how achieving those goals will improve their lives and the lives of others.\r\n\r\nEssay Topic: Participants must write about their learning goals and how achieving those goals will improve their lives and the lives of others. The essay should demonstrate the participant's academic potential and commitment to personal growth and community impact.\r\n\r\nThis scholarship aims to support students who show dedication to their educational journey and have clear vision for how their learning will contribute positively to society.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be graduating US high school seniors OR current undergraduate students (including international students)\r\n- Have a cumulative GPA above 3.0 over the previous school year\r\n- Submit an essay of 500–750 words on learning goals and their impact\r\n- Submit by August 1 at 12:00 p.m. Eastern Time\r\n- Demonstrate how achieving their learning goals will improve their lives and the lives of others",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.nyctutoring.com/scholarship",
    "additionalNotes": "Annual scholarship program. Note: As of recent check, the NYCTutoring.com website indicates 'This year's scholarship has been closed' - status may vary by year. Essay should focus on academic goals, career goals, and impact on others. Open to international students studying in the US."
  },
  {
    "id": "SCH0017",
    "title": "$1500 College Monk Short Essay Scholarship",
    "amount": "$1,500",
    "awards": "1",
    "deadline": "2025/10/15",
    "sponsors": "The Monk Media Inc",
    "description": "The College Monk $1500 short essay scholarship is an essay required scholarship with no GPA requirements. The purpose of the scholarship is to provide financial assistance to high school graduating students or college students who are going to attend an accredited institution in the US.\r\n\r\nThe scholarship is awarded once each year and is available to all eligible students regardless of ethnicity, national origin, or immigration status. The scholarship recipient will be selected based on the essay provided.\r\n\r\nEssay Requirement: Submit an original essay of not less than 300 words addressing the following:\r\n- Tell us about yourself and why you are applying for this scholarship\r\n- Be clear about how this scholarship will help you achieve your personal and professional goals  \r\n- Mention any past achievements of state, national or international fame\r\n\r\nThe scholarship aims to support students pursuing college education and remove financial barriers to higher education access.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be currently pursuing or looking to pursue college education in the next 12 months in the United States\r\n- Be a legal citizen of the U.S. OR an international student with a valid student visa\r\n- Be enrolled or attending an undergraduate or graduate program at an accredited US institution\r\n- Submit an original essay of at least 300 words addressing specified questions\r\n- No GPA requirements\r\n- Available regardless of ethnicity, national origin, or immigration status\r\n- Can be high school graduating students or current college students",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.thecollegemonk.com/collegemonk-scholarship-application",
    "additionalNotes": "Annual scholarship with no GPA requirements. Open to both US citizens and international students with valid student visas. Selection based entirely on essay quality. Note: Website shows 'No Essay' in title but description clearly indicates essay requirement of 300+ words."
  },
  {
    "id": "SCH0018",
    "title": "EduLegit Essay Writing Contest",
    "amount": "$3,000 - $1,000 - $500",
    "awards": "3",
    "deadline": "2025/06/30",
    "sponsors": "EduLegit",
    "description": "EduLegit has launched this writing contest to celebrate the beta testing of their platform and encourage more students to join. The contest aims to hear students' opinions and thoughts about the role of AI in education, work, and daily life.\r\n\r\nAwards:\r\n- 1st place: $3,000 scholarship (grand prize for best essay)\r\n- 2nd place: $1,000 scholarship (reward for exceptional writing skills)  \r\n- 3rd place: $500 scholarship (prize for creative effort and originality)\r\n\r\nEssay Requirements: Write an original 800-word essay on AI-related topics using the EduLegit platform. Essays must demonstrate creativity, diligent approach, and sufficient writing skills.\r\n\r\nContest Process: Submit essay by June 30, qualifying essays published for voting by July 15, voting ends August 15, results announced afterward. The grand prize winner is chosen by EduLegit expert team votes, while 2nd and 3rd place are determined by social media voting from 50 selected creative essays.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Register an account at edulegit.com using the contest sign-up form\r\n- Write and submit essay using only the EduLegit platform (no email submissions accepted)\r\n- Submit original 800-word essay on one of the suggested AI topics or choose own AI-related topic\r\n- Essay must be 100% human-written (no AI writing tools allowed - platform checks for AI content)\r\n- Essay must be plagiarism-free and demonstrate original thinking\r\n- Can research and cite external sources but must cite properly\r\n- Show creativity, critical thinking, and sufficient writing skills\r\n- Submit by June 30, 2025\r\n- Open to students (no specific restrictions mentioned)",
    "studyLevel": "All",
    "fieldOfStudy": "Technology/AI",
    "country": "Global",
    "officialLink": "https://edulegit.com/essay-contest/",
    "additionalNotes": "Contest topics include: Impact of AI on Education, Is Use of AI Cheating?, Is AI an Opportunity or Threat?, Role of AI in Education and Learning, How AI Impacted You. Platform provides feedback on all submissions. Contest runs January-June 2025. Winners can vote for published essays and invite friends to vote."
  },
  {
    "id": "SCH0019",
    "title": "Delete Cyberbullying Social Media Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2026/02/28",
    "sponsors": "Delete Cyberbullying",
    "description": "In an effort to get students committed to the cause of deleting cyberbullying, Delete Cyberbullying is offering this scholarship for high school and college students to help cover educational expenses.\r\n\r\nWe want to raise awareness that much of cyberbullying takes place on social media. Those who spend more time on social media are more likely to be cyberbullied so it's important for students to be aware of the signs of cyberbullying.\r\n\r\nThe organization's mission is to educate students and parents about cyberbullying and to work toward its eradication. This scholarship focuses specifically on social media awareness and the risks associated with increased social media usage.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be a high school student (9th-12th grader), college student, or graduate student\r\n- Be attending or planning to enter an accredited U.S. college or university\r\n- Complete the online application form\r\n- Submit a written statement demonstrating creativity, content, and commitment to the cause of deleting cyberbullying\r\n- Show awareness of cyberbullying signs and social media risks",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.endcyberbullying.net/scholarship-social-media",
    "additionalNotes": "Selection based on written statement focused on creativity, content and commitment to deleting cyberbullying. Organization address: 2261 Market Street #291, San Francisco, CA 94114. Part of three-scholarship program addressing different aspects of cyberbullying."
  },
  {
    "id": "SCH0020",
    "title": "Delete Cyberbullying Mental Health Awareness Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/06/30",
    "sponsors": "Delete Cyberbullying",
    "description": "In an effort to get students committed to the cause of deleting cyberbullying, Delete Cyberbullying is offering this scholarship for high school and college students to help cover educational expenses.\r\n\r\nCyberbullying is often tied to mental health issues, anxiety, and depression. We want to encourage students to be aware of the impact that cyberbullying can have and to watch for the signs of it.\r\n\r\nThe organization's mission is to educate students and parents about cyberbullying and to work toward its eradication. This scholarship focuses specifically on the mental health impact of cyberbullying and increasing awareness of warning signs.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be a high school student (9th-12th grader), college student, or graduate student\r\n- Be attending or planning to enter an accredited U.S. college or university\r\n- Complete the online application form\r\n- Submit a written statement demonstrating creativity, content, and commitment to the cause of deleting cyberbullying\r\n- Show awareness of cyberbullying's mental health impact and warning signs",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.endcyberbullying.net/scholarship-mental-health",
    "additionalNotes": "Selection based on written statement focused on creativity, content and commitment to deleting cyberbullying. Organization address: 2261 Market Street #291, San Francisco, CA 94114. Part of three-scholarship program addressing different aspects of cyberbullying."
  },
  {
    "id": "SCH0021",
    "title": "Delete Cyberbullying Beyond School Walls Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/10/31",
    "sponsors": "Delete Cyberbullying",
    "description": "In an effort to get students committed to the cause of deleting cyberbullying, Delete Cyberbullying is offering this scholarship for high school and college students to help cover educational expenses.\r\n\r\nEven though cyberbullying may occur beyond school walls or outside of school hours, we'd like students to know that there is help both within and outside of school. Students can reach out to a trusted teacher, coach, employer, relative, or other adult for help.\r\n\r\nThe organization's mission is to educate students and parents about cyberbullying and to work toward its eradication. This scholarship focuses specifically on recognizing that cyberbullying extends beyond school environments and promoting awareness of available support systems.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be a high school student (9th-12th grader), college student, or graduate student\r\n- Be attending or planning to enter an accredited U.S. college or university\r\n- Complete the online application form\r\n- Submit a written statement demonstrating creativity, content, and commitment to the cause of deleting cyberbullying\r\n- Show understanding that cyberbullying occurs beyond school and awareness of help resources",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://www.endcyberbullying.net/scholarship-beyond-school-walls",
    "additionalNotes": "Selection based on written statement focused on creativity, content and commitment to deleting cyberbullying. Organization address: 2261 Market Street #291, San Francisco, CA 94114. Part of three-scholarship program addressing different aspects of cyberbullying."
  },
  {
    "id": "SCH0022",
    "title": "LewerMark 'Make Your Mark' Scholarship Contest",
    "amount": "$2,000",
    "awards": "6",
    "deadline": "2025/03/10",
    "sponsors": "LewerMark",
    "description": "LewerMark's 'Make Your Mark' Scholarship Contest invites international students to create original video submissions contrasting American culture with their home culture. The contest encourages creativity through various formats including music videos, commercials, short films, interpretive dance, and more.\r\n\r\nVideo Requirements: Create a 3-minute maximum video describing how American culture differs from your home culture. Be creative - make it funny, dramatic, artistic, or animated! Submissions must be original works created specifically for this scholarship theme.\r\n\r\nJudging Criteria: Submissions evaluated on: Fulfills the request (50%), Creativity (25%), Originality (25%). Bonus points available for faculty/staff letter of recommendation.\r\n\r\nSix winners selected, each receiving $2,000. Winners announced in May and featured on LewerMark's LinkedIn, Facebook & Instagram pages.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be full-time international students with active F, J, M, U, T, R, A, or Q visa-holders OR DACA recipients\r\n- Be currently enrolled in a SEVP-approved US institution\r\n- Be attending classes on a full-time basis\r\n- Be enrolled full-time the following fall, spring, or summer semester\r\n- Submit original 3-minute maximum video on specified theme\r\n- Disclose any AI usage and include prompts/platform names\r\n- Cite sources for any third-party or stock footage used\r\n- Complete scholarship application form\r\n- Submit to scholarships@growyourgiving.org or mail to Greater Kansas City Community Foundation\r\n\r\nExclusions: Students in non-credit bearing vacations, mission trips, service learning, or internships; Lewer employees and their families",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "USA",
    "officialLink": "https://lewermark.com/lewermark-scholarship/",
    "additionalNotes": "Spring deadline: March 10, Fall deadline: October. Winners announced May 2. No copyrighted content allowed. Mail address: Greater Kansas City Community Foundation, 1055 Broadway Blvd., Suite 130, Kansas City, MO 64105. No entry fee required. Established scholarship with past winners from 2020-2025."
  },
  {
    "id": "SCH0023",
    "title": "Kochhar & Co. Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/03/31",
    "sponsors": "Kochhar & Co. Chartered Professional Accountant",
    "description": "Kochhar & Co. Chartered Professional Accountant was founded in 2011 by Biki Kochhar, a Canadian Chartered Professional Accountant, with a small office and a single staff member. Kochhar & Co. specializes in owner-managed corporations based in the Okanagan Valley, and has offices in both downtown Kelowna and Penticton.\r\n\r\nEssay Requirement: Submit an essay under 1000 words answering ONE of the following questions:\r\n1) \"What are the three most important things that an Accountant does for a Company?\"\r\n2) \"What are the three most important things that an Accountant does for an Individual?\"\r\n\r\nEssay Format Requirements: Must follow basic rules of format and grammar with beginning (introductory paragraph), middle (supporting paragraphs), and end (concluding paragraph). Grammar is vital - no sentence fragments, misspellings, or improper punctuation. If quoting sources, must cite using MLA or APA formatting.\r\n\r\nPrevious Winner: Benjamin Lobel",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be attending college or university on a full-time or part-time basis no later than September 2026\r\n- Have achieved a GPA of 2.5 or greater during their last academic year\r\n- Submit essay answer no later than 11:59 PM EST on the deadline\r\n- Be a resident of Canada OR United States\r\n- Can be enrolled in any field of study\r\n- Essay must be under 1000 words and follow proper formatting guidelines\r\n- Submit through online application form on their website",
    "studyLevel": "All",
    "fieldOfStudy": "All Fields",
    "country": "Canada & USA",
    "officialLink": "https://kochharandco.ca/application",
    "additionalNotes": "Contact for questions: ryan@studentscholarships.org. Offices in Kelowna (778-741-0214) and Penticton (778-476-2600). Founded 2011, specializes in owner-managed corporations in Okanagan Valley. Previous winner: Benjamin Lobel. Application requires detailed form including school information."
  },
  {
    "id": "SCH0024",
    "title": "Schaefer Halleen's Social Equity Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/06/30",
    "sponsors": "Schaefer Halleen LLC",
    "description": "Law firm owners and partners Larry Schaefer and Toni Halleen of Schaefer Halleen, LLC, are fierce advocates for victims of discrimination and illegal workplace conduct. Their decades of experience in the field of employment law has shown them the importance of fiercely advocating for justice. Because of its focus on advocating for justice, Schaefer Halleen is pleased to offer one scholarship each year to students who are committed to advocating for and advancing justice for all.\r\n\r\nBenefactors Background:\r\nLawrence P. Schaefer - Over his long and ground-breaking career, Larry has taken on some of the largest and most powerful companies in the country, helping tens of thousands of people recover damages from illegal corporate conduct. He focuses exclusively on representing people who have been subject to employment discrimination at work.\r\n\r\nToni L. Halleen - Toni practiced employment law for many years, helping companies prevent discrimination and comply with legal requirements. She is now the co-owner and Chief Operating Officer of Schaefer Halleen, helping run the firm so the team can effectively advocate for victims in employment discrimination and retaliation matters.\r\n\r\nLarry and Toni have dedicated their careers to empowering clients and seeking justice in response to illegal workplace conduct based on race, religion, gender and other areas.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be accepted into an accredited college or law school in the United States\r\n- Be interested in pursuing a degree that supports gender, religious, or racial justice, or any accredited program that advances the pursuit of justice for all people\r\n- Complete the online application by the deadline\r\n- All application materials must be received by June 30th, 2025\r\n- Award recipient will be notified by July 31st, 2025\r\n- Awards announced by August 31st for Fall Semester 2025\r\n- The award is granted one time per year - all are welcome to apply",
    "studyLevel": "All",
    "fieldOfStudy": "Law, Justice Studies, Social Justice",
    "country": "USA",
    "officialLink": "https://www.schaeferhalleen.com/social-equity-scholarship/",
    "additionalNotes": "Annual $1,000 award. Past winners include Breeze Velazquez (Spring 2024), Maarya Ibrahim (Fall 2023), and Nathnael Alazar (Fall 2022). Scholarship is non-renewable and former recipients not eligible for additional awards. Winner agrees to allow use of name and essay for award announcement. Minneapolis employment law firm."
  },
  {
    "id": "SCH0025",
    "title": "Hoshizaki Ice Maker Supporting STEM Scholarship",
    "amount": "$1,000",
    "awards": "1",
    "deadline": "2025/06/30",
    "sponsors": "HoshizakiIceMaker.com (B & G Refrigeration)",
    "description": "HoshizakiIceMaker.com, hosted by B & G Refrigeration in Jacksonville, FL, offers an annual scholarship for the spring and fall semester to support students involved in science, technology, engineering, and math focused fields of study. We encourage our youth to pursue these areas of study in order to create college graduates who are prepared to work in fields that enhance the economy and complement the business industry.\r\n\r\nWe believe filling STEM jobs with talented young professionals is a critical factor in ensuring the long-term success of America's economy. We are a member of the STEM coalition, and believe that society should improve the way that students learn science, mathematics, technology, and engineering. We believe that the business, education, and STEM communities must work together to achieve this goal.\r\n\r\nAward Distribution: A single award of $1,000, split evenly between fall and spring semester, will be sent to the financial aid office of the winning applicant's academic institution where funds will be disbursed. The awarded funds may be used for any school-related cost at the recipient's discretion.\r\n\r\nWinner announced in late July.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be an undergraduate college student or high school senior\r\n- Have a cumulative minimum of 3.0 GPA\r\n- Maintain full-time enrollment of 12 credit hours or more per college term\r\n- Be a declared major in a science, technology, engineering, or mathematic field of study\r\n- Demonstrate passion for STEM subjects, strong moral character, and leadership ability\r\n- Reside in the U.S., attend a U.S. university, and be legally declared as a U.S. citizen\r\n- Submit required documentation based on student status\r\n\r\nCollege Students: Proof of enrollment in four-year accredited university (class schedule, enrollment verification, acceptance letter, or transcripts)\r\nHigh School Seniors: Current transcript and university acceptance letter (or SAT/ACT scores if no acceptance letter yet)",
    "studyLevel": "Bachelor's",
    "fieldOfStudy": "STEM",
    "country": "USA",
    "officialLink": "https://hoshizakiicemaker.com/stem-scholarship",
    "additionalNotes": "Annual scholarship split between fall and spring semesters. Winner announced late July. SAT/ACT scores verified for finalists. Company hosted by B & G Refrigeration, Jacksonville, FL. Member of STEM coalition. Funds disbursed through financial aid office for any school-related costs."
  },
  {
    "id": "SCH0026",
    "title": "Cavalier Trail Riding Club Scholarship",
    "amount": "$500",
    "awards": "1",
    "deadline": "Not Specified",
    "sponsors": "Cavalier Trail Riding Club",
    "description": "One-time scholarship of $500 accepting applications from high school seniors or current college students for the school year 2025-2026 majoring in an animal-related discipline.\r\n\r\nThe Cavalier Trail Riding Club is based in Colorado Springs, CO and offers this scholarship to support students pursuing education in animal-related fields.\r\n\r\nApplication Requirements:\r\n- A letter or resume stating why you should be the recipient of this award (include hobbies, interests, and relevant organizations you are/have been associated with, plus goals related to your study in this area)\r\n- Two letters of recommendation from persons not related to you\r\n- Transcript of grades for last year of school attended (electronic copy accepted)\r\n\r\nApplications can be submitted either by downloading the application form or filling out the electronic form and uploading required documents.",
    "eligibilityRequirements": "Qualified candidates must:\r\n- Be a high school senior or current college student\r\n- Be majoring in an animal-related discipline\r\n- Be applying for school year 2025-2026\r\n- Submit a letter or resume explaining why they should receive the award\r\n- Include information about hobbies, interests, and relevant organizational involvement\r\n- State goals related to their study in animal-related field\r\n- Provide two letters of recommendation from non-relatives\r\n- Submit transcript of grades for last year of school attended\r\n- Complete application through their website form or downloadable application",
    "studyLevel": "All",
    "fieldOfStudy": "Animal-Related Disciplines",
    "country": "USA",
    "officialLink": "https://cavaliertrc.wixsite.com/ctrc/scholarship-information",
    "additionalNotes": "\"One-time $500 scholarship. Based in Colorado Springs, CO. Organization also accepts donations to scholarship fund via PayPal. Application available as downloadable form or electronic submission with document upload capability.\""
  }
]